app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.where(status: [Order::IN_PROGRESS, Order::SHIPPED]).order("order_date ASC").paginate(page: params[:page], per_page: 30)
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`status` IN ('In progress', 'Shipped')  ORDER BY order_date ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `orders`  WHERE `orders`.`status` IN ('In progress', 'Shipped')